{"input": "Traduza para inglês: Olá mundo", "target": "Translate to English: Hello world"}
{"input": "Resuma: A inteligência artificial está mudando o mundo.", "target": "Artificial intelligence is changing the world."}
{"input": "Explique: O que é machine learning?", "target": "Machine learning is a field of AI focused on teaching computers to learn from data."}
{"input": "Traduza para inglês: Bom dia", "target": "Translate to English: Good morning"}
{"input": "Traduza para inglês: Eu gosto de aprender", "target": "Translate to English: I like to learn"}
{"input": "Traduza para inglês: O céu está azul", "target": "Translate to English: The sky is blue"}
{"input": "Traduza para inglês: Você pode me ajudar?", "target": "Translate to English: Can you help me?"}
{"input": "Traduza para inglês: Estou estudando inteligência artificial", "target": "Translate to English: I am studying artificial intelligence"}
{"input": "Traduza para inglês: Qual é o seu nome?", "target": "Translate to English: What is your name?"}
{"input": "Traduza para inglês: O gato está dormindo", "target": "Translate to English: The cat is sleeping"}
{"input": "Traduza para inglês: Preciso de um café", "target": "Translate to English: I need a coffee"}
{"input": "Traduza para inglês: Vamos começar o projeto", "target": "Translate to English: Let's start the project"}
{"input": "Resuma: O clima hoje está ensolarado com poucas nuvens.", "target": "The weather today is sunny with few clouds."}
{"input": "Resuma: O Brasil é um país com grande diversidade cultural.", "target": "Brazil is a country with great cultural diversity."}
{"input": "Resuma: Aprender novas línguas pode abrir portas profissionais.", "target": "Learning new languages can open professional doors."}
{"input": "Resuma: O futebol é o esporte mais popular do Brasil.", "target": "Soccer is the most popular sport in Brazil."}
{"input": "Resuma: A tecnologia facilita a comunicação global.", "target": "Technology makes global communication easier."}
{"input": "Resuma: A pandemia acelerou o uso de ferramentas digitais.", "target": "The pandemic accelerated the use of digital tools."}
{"input": "Resuma: O café é uma das bebidas mais consumidas no mundo.", "target": "Coffee is one of the most consumed beverages in the world."}
{"input": "Resuma: O transporte público reduz o trânsito nas cidades.", "target": "Public transport reduces city traffic."}
{"input": "Resuma: O desenvolvimento sustentável é importante para o futuro.", "target": "Sustainable development is important for the future."}
{"input": "Explique: Como funciona a energia solar?", "target": "Solar energy works by converting sunlight into electricity using photovoltaic cells."}
{"input": "Explique: O que faz um engenheiro de software?", "target": "A software engineer designs, develops, and maintains computer programs and systems."}
{"input": "Explique: O que é a camada de ozônio?", "target": "The ozone layer is a region of Earth's atmosphere that absorbs most of the sun's ultraviolet radiation."}
{"input": "Explique: Por que a água é importante para a vida?", "target": "Water is essential for life because it supports biological processes and maintains living organisms."}
{"input": "Explique: O que é reciclagem?", "target": "Recycling is the process of converting waste materials into new usable products."}
{"input": "Explique: Como funciona a internet?", "target": "The internet is a global network that connects computers and allows data exchange."}
{"input": "Explique: O que é biodiversidade?", "target": "Biodiversity refers to the variety of living organisms in a particular environment."}
{"input": "Explique: O que é programação?", "target": "Programming is the act of writing instructions for computers to perform tasks."}

{"input": "Traduza para inglês: Eu estou lendo um livro", "target": "Translate to English: I am reading a book"}
{"input": "Traduza para inglês: O cachorro está latindo", "target": "Translate to English: The dog is barking"}
{"input": "Traduza para inglês: A comida está deliciosa", "target": "Translate to English: The food is delicious"}
{"input": "Traduza para inglês: Ela gosta de música clássica", "target": "Translate to English: She likes classical music"}
{"input": "Traduza para inglês: Nós vamos ao cinema amanhã", "target": "Translate to English: We are going to the movies tomorrow"}
{"input": "Traduza para inglês: Eles estão jogando futebol", "target": "Translate to English: They are playing soccer"}
{"input": "Traduza para inglês: Preciso estudar para a prova", "target": "Translate to English: I need to study for the test"}
{"input": "Traduza para inglês: O ônibus está atrasado", "target": "Translate to English: The bus is late"}
{"input": "Traduza para inglês: O computador está ligado", "target": "Translate to English: The computer is on"}
{"input": "Traduza para inglês: O livro está sobre a mesa", "target": "Translate to English: The book is on the table"}

{"input": "Resuma: A água cobre grande parte da superfície da Terra.", "target": "Water covers a large part of Earth's surface."}
{"input": "Resuma: O desmatamento ameaça a biodiversidade.", "target": "Deforestation threatens biodiversity."}
{"input": "Resuma: O transporte aéreo conecta países distantes.", "target": "Air transport connects distant countries."}
{"input": "Resuma: O uso de energias renováveis está crescendo.", "target": "The use of renewable energy is growing."}
{"input": "Resuma: O consumo de plástico deve ser reduzido.", "target": "Plastic consumption should be reduced."}
{"input": "Resuma: O ensino a distância facilita o acesso à educação.", "target": "Distance learning facilitates access to education."}
{"input": "Resuma: O telefone celular revolucionou a comunicação.", "target": "The mobile phone revolutionized communication."}
{"input": "Resuma: O turismo contribui para a economia local.", "target": "Tourism contributes to the local economy."}
{"input": "Resuma: O cinema é uma forma de arte popular.", "target": "Cinema is a popular form of art."}
{"input": "Resuma: O voluntariado ajuda comunidades carentes.", "target": "Volunteering helps needy communities."}

{"input": "Resuma: O aquecimento global afeta o clima mundial.", "target": "Global warming affects the world's climate."}
{"input": "Resuma: A leitura desenvolve o vocabulário.", "target": "Reading develops vocabulary."}
{"input": "Resuma: O esporte promove a saúde.", "target": "Sports promote health."}
{"input": "Resuma: A música une as pessoas.", "target": "Music unites people."}
{"input": "Resuma: O cinema estimula a criatividade.", "target": "Cinema stimulates creativity."}
{"input": "Resuma: A reciclagem reduz o lixo.", "target": "Recycling reduces waste."}
{"input": "Resuma: O trabalho em equipe aumenta a produtividade.", "target": "Teamwork increases productivity."}
{"input": "Resuma: O uso de bicicletas diminui a poluição.", "target": "Bicycle use decreases pollution."}
{"input": "Resuma: O ensino de programação cresce nas escolas.", "target": "Teaching programming is growing in schools."}
{"input": "Resuma: O turismo sustentável preserva o meio ambiente.", "target": "Sustainable tourism preserves the environment."}
{"input": "Resuma: O acesso à internet facilita a pesquisa.", "target": "Internet access facilitates research."}
{"input": "Resuma: O voluntariado desenvolve habilidades sociais.", "target": "Volunteering develops social skills."}
{"input": "Resuma: O uso de energias limpas é fundamental.", "target": "The use of clean energy is fundamental."}
{"input": "Resuma: O ensino remoto ganhou destaque na pandemia.", "target": "Remote teaching gained prominence during the pandemic."}
{"input": "Resuma: O livro digital é cada vez mais popular.", "target": "The digital book is increasingly popular."}
{"input": "Resuma: A vacinação previne doenças.", "target": "Vaccination prevents diseases."}
{"input": "Resuma: O uso de máscaras reduz a transmissão de vírus.", "target": "Mask use reduces virus transmission."}
{"input": "Resuma: O trabalho remoto oferece flexibilidade.", "target": "Remote work offers flexibility."}
{"input": "Resuma: O transporte sustentável é uma tendência global.", "target": "Sustainable transport is a global trend."}
{"input": "Resuma: O ensino bilíngue amplia oportunidades.", "target": "Bilingual education expands opportunities."}
{"input": "Resuma: O smartphone revolucionou a comunicação.", "target": "The smartphone revolutionized communication."}
{"input": "Resuma: O uso de aplicativos facilita o dia a dia.", "target": "App usage makes daily life easier."}
{"input": "Resuma: O ensino de ciências é fundamental para o futuro.", "target": "Science teaching is fundamental for the future."}
{"input": "Resuma: O consumo consciente preserva recursos naturais.", "target": "Conscious consumption preserves natural resources."}
{"input": "Resuma: O cinema nacional está em crescimento.", "target": "National cinema is growing."}
{"input": "Resuma: O esporte incentiva a disciplina.", "target": "Sports encourage discipline."}
{"input": "Resuma: O uso de energia solar está aumentando.", "target": "Solar energy use is increasing."}
{"input": "Resuma: O ensino de idiomas é valorizado no mercado de trabalho.", "target": "Language teaching is valued in the job market."}
{"input": "Resuma: O acesso à informação é facilitado pela internet.", "target": "Access to information is facilitated by the internet."}
{"input": "Resuma: O uso de transporte público é incentivado nas cidades.", "target": "Public transport use is encouraged in cities."}
{"input": "Resuma: O ensino técnico prepara para o mercado de trabalho.", "target": "Technical education prepares for the job market."}
{"input": "Resuma: O uso de energias renováveis é essencial para o planeta.", "target": "The use of renewable energy is essential for the planet."}
{"input": "Resuma: O ensino superior amplia horizontes profissionais.", "target": "Higher education broadens professional horizons."}
{"input": "Resuma: O uso de bicicletas melhora a saúde.", "target": "Bicycle use improves health."}
{"input": "Resuma: O ensino de matemática desenvolve o raciocínio lógico.", "target": "Math teaching develops logical reasoning."}
{"input": "Resuma: O uso de computadores é indispensável no trabalho.", "target": "Computer use is indispensable at work."}
{"input": "Resuma: O ensino de artes estimula a criatividade.", "target": "Arts teaching stimulates creativity."}
{"input": "Resuma: O uso de redes sociais conecta pessoas.", "target": "Social media use connects people."}
{"input": "Resuma: O ensino a distância democratiza a educação.", "target": "Distance learning democratizes education."}
{"input": "Resuma: O uso de energia eólica cresce no Brasil.", "target": "Wind energy use is growing in Brazil."}
{"input": "Resuma: O ensino de física explica fenômenos naturais.", "target": "Physics teaching explains natural phenomena."}
{"input": "Resuma: O uso de tablets facilita o estudo.", "target": "Tablet use facilitates studying."}
{"input": "Resuma: O ensino de história preserva a memória cultural.", "target": "History teaching preserves cultural memory."}
{"input": "Resuma: O uso de carros elétricos reduz a poluição.", "target": "Electric car use reduces pollution."}
{"input": "Resuma: O ensino de biologia ajuda a entender a vida.", "target": "Biology teaching helps understand life."}
{"input": "Resuma: O uso de aplicativos de saúde auxilia no bem-estar.", "target": "Health app use assists well-being."}
{"input": "Resuma: O ensino de literatura incentiva a leitura.", "target": "Literature teaching encourages reading."}
{"input": "Resuma: O uso de energia limpa é tendência mundial.", "target": "Clean energy use is a global trend."}
{"input": "Resuma: O ensino de geografia amplia a visão de mundo.", "target": "Geography teaching broadens worldview."}
{"input": "Resuma: O uso de inteligência artificial cresce nas empresas.", "target": "Artificial intelligence use is growing in companies."}
{"input": "Resuma: O ensino de filosofia estimula o pensamento crítico.", "target": "Philosophy teaching stimulates critical thinking."}
{"input": "Resuma: O uso de softwares educativos melhora o aprendizado.", "target": "Educational software use improves learning."}
{"input": "Resuma: O ensino de química explica reações do cotidiano.", "target": "Chemistry teaching explains everyday reactions."}
{"input": "Resuma: O uso de energia hidráulica é importante no Brasil.", "target": "Hydropower use is important in Brazil."}
{"input": "Resuma: O ensino de educação física promove hábitos saudáveis.", "target": "Physical education promotes healthy habits."}
{"input": "Resuma: O uso de bibliotecas digitais facilita o acesso ao conhecimento.", "target": "Digital libraries facilitate access to knowledge."}
{"input": "Resuma: O ensino de robótica prepara para o futuro.", "target": "Robotics teaching prepares for the future."}
{"input": "Resuma: O uso de podcasts educativos cresce entre estudantes.", "target": "Educational podcast use is growing among students."}
{"input": "Resuma: O ensino de economia ajuda na gestão financeira.", "target": "Economics teaching helps with financial management."}
{"input": "Resuma: O uso de plataformas online amplia o acesso à educação.", "target": "Online platforms broaden access to education."}
{"input": "Resuma: O ensino de línguas estrangeiras facilita viagens internacionais.", "target": "Foreign language teaching facilitates international travel."}
{"input": "Resuma: O uso de drones está em expansão.", "target": "Drone use is expanding."}
{"input": "Resuma: O ensino de programação infantil estimula o raciocínio lógico.", "target": "Children's programming teaching stimulates logical reasoning."}
{"input": "Resuma: O uso de impressoras 3D revoluciona a indústria.", "target": "3D printer use revolutionizes industry."}
{"input": "Resuma: O ensino de ética é essencial na formação cidadã.", "target": "Ethics teaching is essential in citizen formation."}
{"input": "Resuma: O uso de tecnologia assistiva favorece a inclusão.", "target": "Assistive technology use favors inclusion."}
{"input": "Resuma: O ensino de astronomia desperta curiosidade científica.", "target": "Astronomy teaching awakens scientific curiosity."}
{"input": "Resuma: O uso de big data transforma negócios.", "target": "Big data use transforms businesses."}
{"input": "Resuma: O ensino de sustentabilidade é fundamental para o planeta.", "target": "Sustainability teaching is fundamental for the planet."}
{"input": "Resuma: O uso de carros autônomos é tendência futura.", "target": "Autonomous car use is a future trend."}
{"input": "Resuma: O ensino de empreendedorismo incentiva a inovação.", "target": "Entrepreneurship teaching encourages innovation."}
{"input": "Resuma: O uso de redes 5G acelera a comunicação.", "target": "5G network use accelerates communication."}
{"input": "Resuma: O ensino de primeiros socorros salva vidas.", "target": "First aid teaching saves lives."}
{"input": "Resuma: O uso de energia geotérmica é explorado em alguns países.", "target": "Geothermal energy use is explored in some countries."}
{"input": "Resuma: O ensino de lógica é importante na formação matemática.", "target": "Logic teaching is important in math education."}
{"input": "Resuma: O uso de sensores inteligentes melhora a agricultura.", "target": "Smart sensor use improves agriculture."}
{"input": "Resuma: O ensino de cidadania fortalece a democracia.", "target": "Citizenship teaching strengthens democracy."}
{"input": "Resuma: O uso de biometria aumenta a segurança.", "target": "Biometrics use increases security."}
{"input": "Resuma: O ensino de artes visuais desenvolve a percepção estética.", "target": "Visual arts teaching develops aesthetic perception."}
{"input": "Resuma: O uso de algoritmos está presente no cotidiano.", "target": "Algorithm use is present in daily life."}
{"input": "Resuma: O ensino de estatística auxilia na análise de dados.", "target": "Statistics teaching helps with data analysis."}
{"input": "Resuma: O uso de veículos elétricos cresce nas cidades.", "target": "Electric vehicle use is growing in cities."}
{"input": "Resuma: O ensino de educação ambiental é essencial nas escolas.", "target": "Environmental education is essential in schools."}
{"input": "Resuma: O uso de inteligência artificial na medicina avança rapidamente.", "target": "AI use in medicine is advancing rapidly."}
{"input": "Resuma: O ensino de música desenvolve habilidades cognitivas.", "target": "Music teaching develops cognitive skills."}
{"input": "Resuma: O uso de aplicativos bancários facilita transações.", "target": "Banking app use facilitates transactions."}
{"input": "Resuma: O ensino de redação aprimora a comunicação.", "target": "Writing teaching improves communication."}
{"input": "Resuma: O uso de energias alternativas é estratégico para o futuro.", "target": "Alternative energy use is strategic for the future."}
{"input": "Resuma: O ensino de línguas indígenas valoriza a cultura local.", "target": "Indigenous language teaching values local culture."}
{"input": "Resuma: O uso de realidade virtual cresce na educação.", "target": "Virtual reality use is growing in education."}
{"input": "Resuma: O ensino de educação financeira prepara para a vida adulta.", "target": "Financial education prepares for adult life."}
{"input": "Resuma: O uso de energia renovável reduz custos a longo prazo.", "target": "Renewable energy use reduces long-term costs."}
{"input": "Resuma: O ensino de programação melhora o pensamento computacional.", "target": "Programming teaching improves computational thinking."}
{"input": "Resuma: O uso de plataformas digitais amplia o alcance do ensino.", "target": "Digital platforms broaden the reach of teaching."}
{"input": "Resuma: O ensino de robótica estimula o interesse por tecnologia.", "target": "Robotics teaching stimulates interest in technology."}
{"input": "Resuma: O uso de energia limpa contribui para a sustentabilidade.", "target": "Clean energy use contributes to sustainability."}
{"input": "Resuma: O ensino de ética digital é essencial na era da informação.", "target": "Digital ethics teaching is essential in the information age."}
{"input": "Resuma: O uso de automação industrial aumenta a eficiência.", "target": "Industrial automation use increases efficiency."}
{"input": "Resuma: O ensino de ciências da computação é cada vez mais importante.", "target": "Computer science teaching is increasingly important."}
{"input": "Resuma: O uso de energia solar fotovoltaica cresce no Brasil.", "target": "Photovoltaic solar energy use is growing in Brazil."}
{"input": "Resuma: O ensino de línguas estrangeiras amplia horizontes culturais.", "target": "Foreign language teaching broadens cultural horizons."}
{"input": "Resuma: O uso de dispositivos móveis facilita a comunicação.", "target": "Mobile device use facilitates communication."}
{"input": "Resuma: O ensino de sustentabilidade prepara para desafios ambientais.", "target": "Sustainability teaching prepares for environmental challenges."}
{"input": "Resuma: O uso de inteligência artificial otimiza processos.", "target": "AI use optimizes processes."}
{"input": "Resuma: O ensino de ciências naturais desperta curiosidade.", "target": "Natural sciences teaching awakens curiosity."}
{"input": "Resuma: O uso de carros híbridos reduz o consumo de combustível.", "target": "Hybrid car use reduces fuel consumption."}
{"input": "Resuma: O ensino de história ajuda a compreender o presente.", "target": "History teaching helps understand the present."}
{"input": "Resuma: O uso de energia limpa protege o meio ambiente.", "target": "Clean energy use protects the environment."}
{"input": "Resuma: O ensino de matemática é base para outras ciências.", "target": "Math teaching is the basis for other sciences."}
{"input": "Resuma: O uso de aplicativos de aprendizagem cresce no mundo todo.", "target": "Learning app use is growing worldwide."}
{"input": "Resuma: O ensino de literatura amplia o repertório cultural.", "target": "Literature teaching broadens cultural repertoire."}
{"input": "Resuma: O uso de energia renovável é prioridade global.", "target": "Renewable energy use is a global priority."}

{"input": "Explique: Como funciona a fotossíntese?", "target": "Photosynthesis is the process by which plants convert sunlight into energy."}
{"input": "Explique: O que é um eclipse solar?", "target": "A solar eclipse occurs when the moon passes between the Earth and the sun."}
{"input": "Explique: O que é um átomo?", "target": "An atom is the basic unit of matter, composed of protons, neutrons, and electrons."}
{"input": "Explique: O que é democracia?", "target": "Democracy is a system of government where citizens exercise power by voting."}
{"input": "Explique: O que é economia circular?", "target": "Circular economy is a model of production and consumption that encourages reuse and recycling."}
{"input": "Explique: O que é efeito estufa?", "target": "The greenhouse effect is the warming of Earth's surface due to trapped heat from the atmosphere."}
{"input": "Explique: O que é inteligência artificial?", "target": "Artificial intelligence is the simulation of human intelligence by machines."}
{"input": "Explique: O que é blockchain?", "target": "Blockchain is a decentralized digital ledger used to record transactions securely."}
{"input": "Explique: Como funciona a vacina?", "target": "A vaccine stimulates the immune system to protect against diseases."}
{"input": "Explique: O que é sustentabilidade?", "target": "Sustainability is the practice of meeting current needs without compromising future generations."}
